# coding=utf8
from jikanpy import Jikan
jikan = Jikan()
wordList = ['自然','住民','対立','反対','特急','目的','並ぶ','入院','亡くなる','疲れる','危険','注目','確か','確認','機械','具体的','基づく','備える','設計','設ける','説明','公開','実際','飛行場','航空便','船便','船','空港','港','完成','平成','成功','原因','ふすま','資金','投資','正確','正しい','正月','正直','異なる','通常','非常','強調','季節','調査','提供','提案','案内','示す','連れて 行く','連れて 来る','続ける','相手','相談','ひげ','関する','関連','関係','状況','ぐっすり','状態','政治','政府','党','対策','政策','選手','選挙','候補','首相','首都','改革','革','命令','番組','組み 立てる','組織','進める','進む','進学','拡大','おかず','責任','通勤','勤める','事務所','事務室','従来','成績','集める','集まる','採用','給料','卒業','就職','契約','交渉','事件','条件','参加','増加','加える','加工','比べる','批判','評価','対象','故障','修理','被る','破る','破れる','壊す','救急車','管理','殺す','逮捕','戦争','競争','混む','大統領','拾う','池','浅い','ごみ','水泳','流れる','流行る','洗う','洗面所','油','沈む','氷','冷える','冷やす','冷める','凍る','冷蔵庫','涼しい','汚す','汚れ','汚れる','景色','影響','太陽','星','地震','震える','振る','揺れる','神社','いかが','年寄り','歴史','世紀','建設','構成','構造','橋','柱','位置','離婚','判断','断る','横断歩道','大幅','訪れる','訪ねる','冷房','暖房','文房具','諸国','貿易','輸入','輸出','指輪','往復','復習','繰り 返す','書留','留守','住宅','自宅','お 宅','趣味','両方','両替','片道','内側','裏','裏返す','週刊誌','朝刊','夕刊','詳しい','細かい','細か','積もる','検討','塗る','受け 付ける','片付ける','どなた','受付','近付く','片付く','貼る','記念日','例えば','例文','例','余る','除く','削る','遅刻','緩い','苦しい','苦い','苦手','困る','不幸','幸せ','塩','塩辛い','砂糖','規模','農業','濃い','薄い','厚い','厚さ','迫る','伸びる','追い 越す','上昇','改札口','かゆい','お 礼','謝る','注射','程度','ぐらぐら','誘う','導入','努力','占める','処理','紹介','招く','招待','夫婦','奥','よろしい','国籍','祝日','お 祝い','泣く','涙','喜ぶ','看護師','患者','述べる','訴える','迷う','迷惑','地域','政権','与える','貯金','預ける','預かる','得意','どきどき','燃える','乾く','乾杯','乾かす','海岸','家庭','咲く','吹く','散歩','植える','屋根','黒板','掲示板','からから','草','ふらふら','吸う','普及','胃','こぼす','血','内容','背景','骨','滑る','折れる','折る','健康','珍しい','再び','放送','装置','固い','美術館','美容院','よろしく','博物館','開催','特徴','がらがら','免許証','教師','教授','伝える','ぎらぎら','鳴る','鳴く','馬','駐車場','騒ぐ','刺す','刺身','激しい','ぺこぺこ','驚く','倒れる','倒す','傾向','ぺらぺら','柔道','主張','引っ 張る','壁','攻撃','いつごろ','絶対に','消防車','大抵','大勢','姿','姿勢','恐ろしい','孫','木綿','偉い','爪','方針','釣る','やけど','お 釣り','鍋','泥棒','湯','沸く','沸かす','洗濯機','洗濯','濡れる','喫茶店','あんなに','休憩','天井','いたずら','納豆','化粧','畑','炊く','自炊','西暦','髪','舌','くし','臭い','居る','履く','戸','扇風機','ごちそう','鶏','腕時計','お 菓子','お 辞儀','ごちそうする','万年筆','こぼれる','箱','本箱','財布','毛布','布団','小包','ざあざあ','包む','飾る','牛乳','玄関','封筒','出かける','かかる','掛け 算','拍手','掃除','掃く','ちょうど','掃除機','握る','握手','迎える','お 巡りさん','穴','怪我','我慢','幼稚園','隠れる','とんとん','日陰','随分','頑張る','頃','人参','この 頃','消防署','尋ねる','缶詰','ぬるい','腐る','豆腐','床','床屋','干す','ひざ','帽子','ぜひ','ひじ','敷く','雷','仕舞う','ひも','踏む','踏切','まく','蹴る','文章','やかん','ようこそ','祖父','祖母','邪魔','風邪薬','昭和','紫','そんなに','紅茶','梅雨','遭う','枕','遠慮','叱る','年賀状','賑やか','蚊','拭く','挨拶','伴う','巻く','磨く','歯磨き','廊下','瓶','褒める','元旦','袖','長袖','半袖','馬鹿    ','剃る','喧嘩','叩く','噛む','味噌汁','苺','茄子','逢う','箸','糊','醤油','鋏','鞄','顎','飴','石鹸','差','失う','外れる','測る','含める','含む','頂戴']
titleList = []

try:
    for word in wordList:
        print(word)
        anime = jikan.search('anime', word, parameters={'order_by': 'members'})
        resutsTitleList = []
        print(anime)
        for result in anime['results']:
            resutsTitleList.append(result['title'])
        titleList.append(resutsTitleList)
    print(titleList)
except Exception as e:
    print("err, finalizing")

lineList = []
for entry in titleList:
    lineList.append(' ,'.join(entry))
lineStr = '\n'.join(lineList)
with open('res.txt', 'w') as file:
    file.write(lineStr)
